{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "id2label": {
    "0": "LAPTOP",
    "1": "DISPLAY",
    "2": "KEYBOARD",
    "3": "MOUSE",
    "4": "MOTHERBOARD",
    "5": "CPU",
    "6": "FANS_COOLING",
    "7": "PORTS",
    "8": "MEMORY",
    "9": "POWER_SUPPLY",
    "10": "OPTICAL_DRIVES",
    "11": "BATTERY",
    "12": "GRAPHICS",
    "13": "HARD_DISK",
    "14": "MULTIMEDIA_DEVICES",
    "15": "HARDWARE",
    "16": "SOFTWARE",
    "17": "OS",
    "18": "WARRANTY",
    "19": "SHIPPING",
    "21": "SUPPORT",
    "22": "COMPANY",
    "23": "OUT_OF_SCOPE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "label2id": {
    "BATTERY": 11,
    "COMPANY": 22,
    "CPU": 5,
    "DISPLAY": 1,
    "FANS_COOLING": 6,
    "GRAPHICS": 12,
    "HARDWARE": 15,
    "HARD_DISK": 13,
    "KEYBOARD": 2,
    "LAPTOP": 0,
    "MEMORY": 8,
    "MOTHERBOARD": 4,
    "MOUSE": 3,
    "MULTIMEDIA_DEVICES": 14,
    "OPTICAL_DRIVES": 10,
    "OS": 17,
    "OUT_OF_SCOPE": 23,
    "PORTS": 7,
    "POWER_SUPPLY": 9,
    "SHIPPING": 19,
    "SOFTWARE": 16,
    "SUPPORT": 21,
    "WARRANTY": 18
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 2,
  "num_hidden_layers": 2,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
